# IsValidGeometry Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ExternallyTaggedGeometryValidation..::..IsValidGeometry Method
ExternallyTaggedGeometryValidation Class See Also
---
Validates the input geometry to be stored in an externally tagged geometry object. Valid types of geometry are: Solid, Mesh, GeometryInstance, Point and Curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static bool IsValidGeometry(
	GeometryObject geometry
)
```

Visual Basic
---
```text
Public Shared Function IsValidGeometry ( _
	geometry As GeometryObject _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidGeometry(
	GeometryObject^ geometry
)
```

# ### Parameters
geometry
    Type: Autodesk.Revit.DB..::..GeometryObject Geometry object to be validated.
# ### Return Value
True if the supplied geometry object passes the validation criteria.
# See Also
ExternallyTaggedGeometryValidation Class
Autodesk.Revit.DB Namespace